
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   12.1   Copyright 1985-2011 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

14-user 8-core Stata network perpetual license:
       Serial number:  50120572412
         Licensed to:  National Bureau of Economic Research
                       Cambridge, MA 02138

Notes:
      1.  (-v# option or -set maxvar-) 5000 maximum variables
      2.  Command line editing disabled
      3.  Stata running in batch mode


running /usr/local/stata12/sysprofile.do ...

. do absorb_2.do

.
. /*
> A note on file names.
> Two pieces of information are included in filenames:
>         --> what the sample is. Options are
>                 a) "Full" - full-time, year-round workers (35+ hours, 40+ wee
> ks)
>                 b) "All"  - All workers
>                 c) "FullBA" - College graduate workers full-time, year-round
>                 d) "AllBA" - College Grads (regardless of hours and weeks)
>
>         --> what is included in the regression
>                 a) "Basic" - female dummy, occ dummies, occ x female dummies,
>  age as quartic, race
>                 b) "Educ" - Basic + schooling dummies
>                 c) "Time" - either "basic" or "educ" with ln(hours) and ln(we
> eks)
> For example "Full-Basic.dta" includes
> coefficients on the regression that includes full time, year round workers wi
> th only base controls.
> */
.
.
.
. clear all

. pause on

. set more off

. set matsize 1200

. capture log close

. set varabbrev off

. global path "/disk/bulkv/emanueln/ACS/female_wage2"

. //to run on local computer, not on server:
. //global path "Z:/bulk/ACS/female_wage2"
.
.
. log using "${path}/absorb.txt", append text
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /disk/bulkv/emanueln/ACS/female_wage2/absorb.txt
  log type:  text
 opened on:  29 Sep 2013, 09:11:39

.
.
. *-------------------------------------------------------------------*
.
.         *Setup
.
. *-------------------------------------------------------------------*
.
.         use "${path}/cleaned.dta", clear

.         //drop fixed effects because "absorb" takes care of that
.         drop occfe_*  intx_*

.         tempfile cleaned

.         save `cleaned'
file /tmp/St07253.000001 saved

.
. //---------------------------------------------------------------------------
> ---//
. //          All forms of Regressions
>                                            //
. //---------------------------------------------------------------------------
> ---//
.
.
. //variables in regression
. local basevar lnincwbf female age age2 age3 age4 black hisp other aspi year09
>  year10

. local timevar lnhrs lnweeks

. local educ school1 school2 school3 school4 school5 school6 school7 school8 sc
> hool9 school11 school12 school13

. local educBA school11 school12 school13

.
.
. //Regressions for Full
. //Full Basic
. use `cleaned', clear

.         //appropriate sample
.         keep if full==1
(708089 observations deleted)

.         count if incwbf < min
    0

.         drop if incwbf < min
(0 observations deleted)

.
. display  "Full, Basic"
Full, Basic

.         reg `basevar' [aw=perwt], r
(sum of wgt is   2.6972e+06)

Linear regression                                      Number of obs = 2603968
                                                       F( 10,2603956) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1117
                                                       Root MSE      =  .66236

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2478178   .0010133  -244.57   0.000    -.2498038   -.2458319
         age |   .3674438   .0184918    19.87   0.000     .3312006     .403687
        age2 |  -.0100815    .000685   -14.72   0.000     -.011424    -.008739
        age3 |   .0001238    .000011    11.25   0.000     .0001022    .0001454
        age4 |  -5.77e-07   6.48e-08    -8.90   0.000    -7.04e-07   -4.50e-07
       black |  -.2485409    .001668  -149.01   0.000    -.2518101   -.2452718
        hisp |  -.3974205   .0015269  -260.28   0.000    -.4004133   -.3944278
       other |  -.1462736   .0037344   -39.17   0.000    -.1535929   -.1389544
        aspi |   .0377691   .0024867    15.19   0.000     .0328953    .0426429
      year09 |   -.016973   .0012637   -13.43   0.000    -.0194499   -.0144961
      year10 |  -.0122537   .0012672    -9.67   0.000    -.0147374     -.00977
       _cons |   5.902179   .1824512    32.35   0.000     5.544581    6.259777
------------------------------------------------------------------------------

. display  "Full, Basic, Time"
Full, Basic, Time

.         reg `basevar' `timevar' [aw=perwt], r
(sum of wgt is   2.6972e+06)

Linear regression                                      Number of obs = 2603968
                                                       F( 12,2603954) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1626
                                                       Root MSE      =  .64312

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.1929525   .0010043  -192.13   0.000    -.1949208   -.1909841
         age |   .3304965   .0179414    18.42   0.000      .295332     .365661
        age2 |  -.0089347   .0006649   -13.44   0.000    -.0102379   -.0076315
        age3 |   .0001075   .0000107    10.05   0.000     .0000865    .0001284
        age4 |  -4.86e-07   6.30e-08    -7.72   0.000    -6.10e-07   -3.63e-07
       black |  -.2222173   .0016281  -136.49   0.000    -.2254084   -.2190262
        hisp |  -.3623104   .0014857  -243.86   0.000    -.3652224   -.3593984
       other |  -.1351631   .0036427   -37.11   0.000    -.1423026   -.1280236
        aspi |   .0486522   .0024775    19.64   0.000     .0437964    .0535081
      year09 |  -.0129015    .001227   -10.51   0.000    -.0153064   -.0104965
      year10 |  -.0096247   .0012317    -7.81   0.000    -.0120388   -.0072106
       lnhrs |   .8941376   .0037857   236.19   0.000     .8867177    .9015575
     lnweeks |   1.489249   .0111137   134.00   0.000     1.467467    1.511032
       _cons |  -2.913942   .1824107   -15.97   0.000     -3.27146   -2.556423
------------------------------------------------------------------------------

. display  "Full, Basic, Time, ABSORB ALL OCCS"
Full, Basic, Time, ABSORB ALL OCCS

.         areg `basevar' `timevar' [aw=perwt], absorb(occ2) r
(sum of wgt is   2.6972e+06)

Linear regression, absorbing indicators           Number of obs   =    2603968
                                                  F(  12,2603486) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.4182
                                                  Adj R-squared   =     0.4181
                                                  Root MSE        =     0.5361

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2065009   .0010702  -192.96   0.000    -.2085984   -.2044034
         age |   .0695057   .0153489     4.53   0.000     .0394224    .0995889
        age2 |  -.0004281   .0005672    -0.75   0.450    -.0015398    .0006836
        age3 |  -.0000128   9.10e-06    -1.40   0.161    -.0000306    5.07e-06
        age4 |   1.39e-07   5.35e-08     2.59   0.010     3.39e-08    2.44e-07
       black |   -.092356   .0014182   -65.12   0.000    -.0951356   -.0895764
        hisp |  -.1381746   .0013058  -105.82   0.000    -.1407338   -.1356153
       other |  -.0741773   .0031036   -23.90   0.000    -.0802602   -.0680944
        aspi |  -.0004709   .0019524    -0.24   0.809    -.0042976    .0033557
      year09 |  -.0128997   .0010418   -12.38   0.000    -.0149417   -.0108577
      year10 |  -.0100584   .0010347    -9.72   0.000    -.0120863   -.0080304
       lnhrs |   .5991402   .0033319   179.82   0.000     .5926098    .6056706
     lnweeks |   1.081076   .0097589   110.78   0.000     1.061949    1.100203
       _cons |   2.675001   .1569644    17.04   0.000     2.367356    2.982646
-------------+----------------------------------------------------------------
        occ2 |   absorbed                                     (469 categories)

. display  "Full, Basic, Time, Educ"
Full, Basic, Time, Educ

.         reg `basevar' `timevar' `educ' [aw=perwt], r
(sum of wgt is   2.6972e+06)

Linear regression                                      Number of obs = 2603968
                                                       F( 24,2603942) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.3393
                                                       Root MSE      =  .57123

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |    -.24717   .0009045  -273.26   0.000    -.2489428   -.2453971
         age |   .1754949   .0162613    10.79   0.000     .1436233    .2073665
        age2 |  -.0040606   .0006015    -6.75   0.000    -.0052396   -.0028817
        age3 |   .0000443   9.66e-06     4.59   0.000     .0000254    .0000633
        age4 |  -2.03e-07   5.68e-08    -3.57   0.000    -3.14e-07   -9.16e-08
       black |  -.1480377   .0014827   -99.84   0.000    -.1509437   -.1451316
        hisp |  -.1507975   .0014628  -103.09   0.000    -.1536644   -.1479305
       other |  -.0945153   .0033321   -28.36   0.000    -.1010461   -.0879844
        aspi |  -.0559527   .0021264   -26.31   0.000    -.0601204    -.051785
      year09 |  -.0032564   .0010977    -2.97   0.003    -.0054078    -.001105
      year10 |  -.0061984   .0011003    -5.63   0.000     -.008355   -.0040418
       lnhrs |   .6497508   .0033819   192.13   0.000     .6431225    .6563792
     lnweeks |   1.443219   .0101091   142.76   0.000     1.423405    1.463032
     school1 |  -.8208694   .0056008  -146.56   0.000    -.8318468    -.809892
     school2 |  -.8744927   .0064927  -134.69   0.000    -.8872181   -.8617674
     school3 |   -.830635    .003325  -249.81   0.000     -.837152    -.824118
     school4 |  -.7872519   .0043942  -179.16   0.000    -.7958644   -.7786393
     school5 |  -.7397842   .0042766  -172.99   0.000    -.7481661   -.7314023
     school6 |  -.7224626   .0039198  -184.31   0.000    -.7301453   -.7147799
     school7 |  -.5276243   .0012483  -422.67   0.000    -.5300709   -.5251776
     school8 |  -.3652479   .0014804  -246.72   0.000    -.3681494   -.3623463
     school9 |  -.2826238   .0016672  -169.52   0.000    -.2858915   -.2793562
    school11 |   .1801942   .0017014   105.91   0.000     .1768596    .1835289
    school12 |   .4996841   .0035634   140.23   0.000        .4927    .5066682
    school13 |   .3113806   .0039234    79.37   0.000     .3036909    .3190703
       _cons |   .1588119   .1659522     0.96   0.339    -.1664487    .4840725
------------------------------------------------------------------------------

. display  "Full, Basic, Time, Educ, ABSORB ALL OCCS"
Full, Basic, Time, Educ, ABSORB ALL OCCS

.         areg `basevar' `timevar' `educ' [aw=perwt], absorb(occ2) r
(sum of wgt is   2.6972e+06)

Linear regression, absorbing indicators           Number of obs   =    2603968
                                                  F(  24,2603474) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.4531
                                                  Adj R-squared   =     0.4530
                                                  Root MSE        =     0.5198

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.1921004   .0010356  -185.49   0.000    -.1941301   -.1900706
         age |   .0559564    .014949     3.74   0.000     .0266569    .0852559
        age2 |  -.0001169   .0005523    -0.21   0.832    -.0011994    .0009656
        age3 |  -.0000141   8.86e-06    -1.59   0.111    -.0000315    3.25e-06
        age4 |   1.25e-07   5.21e-08     2.39   0.017     2.26e-08    2.27e-07
       black |  -.0821826   .0013858   -59.30   0.000    -.0848988   -.0794664
        hisp |  -.0820048   .0013418   -61.12   0.000    -.0846346   -.0793749
       other |  -.0653551   .0030445   -21.47   0.000    -.0713222   -.0593879
        aspi |  -.0461374   .0019196   -24.03   0.000    -.0498998    -.042375
      year09 |  -.0086581   .0010129    -8.55   0.000    -.0106434   -.0066728
      year10 |  -.0078843   .0010046    -7.85   0.000    -.0098532   -.0059153
       lnhrs |   .5439705   .0032355   168.13   0.000      .537629     .550312
     lnweeks |   1.082194   .0095938   112.80   0.000     1.063391    1.100998
     school1 |   -.461613   .0053373   -86.49   0.000    -.4720739   -.4511521
     school2 |  -.4903079    .006279   -78.09   0.000    -.5026145   -.4780013
     school3 |  -.4636385   .0033731  -137.45   0.000    -.4702497   -.4570274
     school4 |   -.450374   .0042894  -105.00   0.000     -.458781   -.4419669
     school5 |  -.4257449   .0041424  -102.78   0.000    -.4338639   -.4176259
     school6 |  -.4181221   .0038313  -109.13   0.000    -.4256312   -.4106129
     school7 |  -.2971554    .001376  -215.95   0.000    -.2998524   -.2944584
     school8 |  -.2187003   .0014777  -148.00   0.000    -.2215965    -.215804
     school9 |   -.198529   .0015858  -125.19   0.000    -.2016371    -.195421
    school11 |   .1733315   .0016386   105.78   0.000     .1701199    .1765431
    school12 |   .2352867   .0045211    52.04   0.000     .2264255     .244148
    school13 |   .2771468   .0042031    65.94   0.000     .2689089    .2853847
       _cons |   3.181833   .1530821    20.79   0.000     2.881797    3.481868
-------------+----------------------------------------------------------------
        occ2 |   absorbed                                     (469 categories)

.
. //All
. use `cleaned', clear

.         //Wage restrictions (All)
.                 //lower bound
.                 count if hwage<3
18895

.                 drop if hwage<3
(18895 observations deleted)

.                 //upperbound
.                 count if hwage>500 & full==0
 1994

.                 drop if hwage>500 & full==0
(1994 observations deleted)

. display  "All, Basic"
All, Basic

.         reg `basevar' [aw=perwt], r
(sum of wgt is   3.4096e+06)

Linear regression                                      Number of obs = 3291168
                                                       F( 10,3291156) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1023
                                                       Root MSE      =  .76789

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3199119   .0010462  -305.78   0.000    -.3219625   -.3178614
         age |   .5731433    .019084    30.03   0.000     .5357394    .6105472
        age2 |  -.0175226   .0007064   -24.81   0.000     -.018907   -.0161381
        age3 |   .0002424   .0000113    21.37   0.000     .0002201    .0002646
        age4 |  -1.28e-06   6.67e-08   -19.14   0.000    -1.41e-06   -1.15e-06
       black |  -.2278575   .0017356  -131.28   0.000    -.2312593   -.2244557
        hisp |  -.3900068   .0015112  -258.08   0.000    -.3929687    -.387045
       other |  -.1668432   .0038662   -43.15   0.000    -.1744209   -.1592656
        aspi |   .0513965    .002507    20.50   0.000     .0464829    .0563101
      year09 |  -.0100102   .0013036    -7.68   0.000    -.0125651   -.0074553
      year10 |  -.0132174   .0013071   -10.11   0.000    -.0157792   -.0106557
       _cons |   3.633316   .1884072    19.28   0.000     3.264045    4.002587
------------------------------------------------------------------------------

. display  "All, Basic, Time"
All, Basic, Time

.         reg `basevar' `timevar' [aw=perwt], r
(sum of wgt is   3.4096e+06)

Linear regression                                      Number of obs = 3291168
                                                       F( 12,3291154) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.3528
                                                       Root MSE      =  .65202

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.1960694   .0009253  -211.90   0.000     -.197883   -.1942559
         age |   .3182554   .0160784    19.79   0.000     .2867423    .3497686
        age2 |  -.0085183    .000596   -14.29   0.000    -.0096865   -.0073501
        age3 |   .0001009   9.58e-06    10.53   0.000     .0000821    .0001196
        age4 |  -4.45e-07   5.65e-08    -7.88   0.000    -5.55e-07   -3.34e-07
       black |  -.2024458   .0014732  -137.42   0.000    -.2053333   -.1995584
        hisp |  -.3367962   .0013043  -258.21   0.000    -.3393527   -.3342398
       other |  -.1257981   .0032318   -38.93   0.000    -.1321323   -.1194639
        aspi |   .0586478   .0022235    26.38   0.000     .0542898    .0630057
      year09 |  -.0102343   .0011091    -9.23   0.000    -.0124081   -.0080605
      year10 |  -.0071839   .0011093    -6.48   0.000     -.009358   -.0050098
       lnhrs |   .9684424   .0021705   446.18   0.000     .9641883    .9726965
     lnweeks |   .7888665   .0018362   429.62   0.000     .7852676    .7924653
       _cons |   -.336086   .1585444    -2.12   0.034    -.6468275   -.0253445
------------------------------------------------------------------------------

. display  "All, Basic, Time, ABSORB ALL OCCS"
All, Basic, Time, ABSORB ALL OCCS

.         areg `basevar' `timevar' [aw=perwt], absorb(occ2) r
(sum of wgt is   3.4096e+06)

Linear regression, absorbing indicators           Number of obs   =    3291168
                                                  F(  12,3290686) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.5414
                                                  Adj R-squared   =     0.5413
                                                  Root MSE        =     0.5489

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2034968   .0009882  -205.93   0.000    -.2054336   -.2015599
         age |   .0981984   .0138815     7.07   0.000     .0709912    .1254056
        age2 |  -.0015981   .0005132    -3.11   0.002    -.0026039   -.0005923
        age3 |   6.91e-06   8.23e-06     0.84   0.401    -9.22e-06     .000023
        age4 |   2.16e-08   4.84e-08     0.45   0.655    -7.32e-08    1.16e-07
       black |  -.0703521   .0012987   -54.17   0.000    -.0728975   -.0678068
        hisp |   -.115729   .0011697   -98.94   0.000    -.1180216   -.1134364
       other |  -.0629683   .0027928   -22.55   0.000    -.0684421   -.0574945
        aspi |   .0092176   .0017845     5.17   0.000     .0057202    .0127151
      year09 |   -.010674   .0009503   -11.23   0.000    -.0125366   -.0088114
      year10 |   -.008018   .0009413    -8.52   0.000     -.009863   -.0061731
       lnhrs |   .7694046   .0019231   400.09   0.000     .7656354    .7731737
     lnweeks |   .7236456   .0017351   417.06   0.000     .7202448    .7270464
       _cons |   3.138707   .1373771    22.85   0.000     2.869453    3.407961
-------------+----------------------------------------------------------------
        occ2 |   absorbed                                     (469 categories)

. display  "All, Basic, Time, Educ"
All, Basic, Time, Educ

.         reg `basevar' `timevar' `educ' [aw=perwt], r
(sum of wgt is   3.4096e+06)

Linear regression                                      Number of obs = 3291168
                                                       F( 24,3291142) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.4753
                                                       Root MSE      =   .5871

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2453309   .0008468  -289.71   0.000    -.2469906   -.2436712
         age |   .2271098   .0147641    15.38   0.000     .1981726     .256047
        age2 |  -.0059566   .0005464   -10.90   0.000    -.0070274   -.0048857
        age3 |   .0000738   8.77e-06     8.42   0.000     .0000566     .000091
        age4 |  -3.68e-07   5.16e-08    -7.12   0.000    -4.69e-07   -2.67e-07
       black |  -.1228302   .0013594   -90.36   0.000    -.1254945   -.1201658
        hisp |  -.1300295    .001308   -99.41   0.000    -.1325931   -.1274659
       other |  -.0827547   .0029841   -27.73   0.000    -.0886035    -.076906
        aspi |  -.0390676   .0019475   -20.06   0.000    -.0428847   -.0352506
      year09 |  -.0006565   .0010045    -0.65   0.513    -.0026253    .0013124
      year10 |  -.0034539   .0010047    -3.44   0.001     -.005423   -.0014848
       lnhrs |   .8816681    .002022   436.04   0.000     .8777051    .8856311
     lnweeks |   .7543378   .0017814   423.46   0.000     .7508464    .7578292
     school1 |  -.7452866   .0048418  -153.93   0.000    -.7547764   -.7357968
     school2 |  -.8212093   .0055625  -147.63   0.000    -.8321115   -.8103071
     school3 |  -.7754154   .0028798  -269.26   0.000    -.7810597   -.7697711
     school4 |  -.7355522   .0038031  -193.41   0.000    -.7430061   -.7280983
     school5 |  -.6993153   .0035986  -194.33   0.000    -.7063684   -.6922622
     school6 |  -.6829226   .0033501  -203.85   0.000    -.6894888   -.6763565
     school7 |  -.5063437   .0011485  -440.87   0.000    -.5085947   -.5040926
     school8 |  -.3554969   .0013663  -260.20   0.000    -.3581747   -.3528191
     school9 |  -.2611893   .0015536  -168.12   0.000    -.2642343   -.2581444
    school11 |   .1818686   .0016034   113.43   0.000      .178726    .1850111
    school12 |   .4912051   .0033435   146.92   0.000     .4846521    .4977582
    school13 |   .3221143   .0038084    84.58   0.000       .31465    .3295786
       _cons |    1.44742    .145919     9.92   0.000     1.161424    1.733416
------------------------------------------------------------------------------

. display  "All, Basic, Time, Educ, ABSORB ALL OCCS"
All, Basic, Time, Educ, ABSORB ALL OCCS

.         areg `basevar' `timevar' `educ' [aw=perwt], absorb(occ2) r
(sum of wgt is   3.4096e+06)

Linear regression, absorbing indicators           Number of obs   =    3291168
                                                  F(  24,3290674) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.5632
                                                  Adj R-squared   =     0.5631
                                                  Root MSE        =     0.5357

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.1908364   .0009634  -198.08   0.000    -.1927247   -.1889481
         age |   .0994272   .0136057     7.31   0.000     .0727606    .1260938
        age2 |  -.0018108   .0005029    -3.60   0.000    -.0027964   -.0008251
        age3 |   .0000135   8.06e-06     1.67   0.095    -2.33e-06    .0000293
        age4 |  -3.60e-08   4.74e-08    -0.76   0.448    -1.29e-07    5.70e-08
       black |  -.0579247   .0012759   -45.40   0.000    -.0604255    -.055424
        hisp |  -.0626136   .0012106   -51.72   0.000    -.0649864   -.0602409
       other |  -.0536825    .002749   -19.53   0.000    -.0590706   -.0482945
        aspi |  -.0300771   .0017638   -17.05   0.000     -.033534   -.0266201
      year09 |  -.0066447   .0009296    -7.15   0.000    -.0084667   -.0048227
      year10 |  -.0059225   .0009199    -6.44   0.000    -.0077256   -.0041195
       lnhrs |   .7581371    .001906   397.76   0.000     .7544014    .7618728
     lnweeks |   .7221348   .0017326   416.78   0.000     .7187388    .7255307
     school1 |  -.3906333   .0046234   -84.49   0.000     -.399695   -.3815715
     school2 |  -.4443311    .005417   -82.03   0.000    -.4549482   -.4337139
     school3 |  -.4148267    .002927  -141.73   0.000    -.4205634     -.40909
     school4 |  -.3989922   .0037321  -106.91   0.000     -.406307   -.3916774
     school5 |  -.3804462   .0035282  -107.83   0.000    -.3873613   -.3735311
     school6 |  -.3742836   .0032851  -113.94   0.000    -.3807222    -.367845
     school7 |  -.2660905   .0012547  -212.08   0.000    -.2685496   -.2636314
     school8 |  -.1986838   .0013597  -146.13   0.000    -.2013487   -.1960188
     school9 |   -.178509   .0014703  -121.41   0.000    -.1813908   -.1756272
    school11 |   .1683159   .0015524   108.42   0.000     .1652733    .1713585
    school12 |   .2196307   .0042148    52.11   0.000     .2113699    .2278916
    school13 |   .2756407   .0040454    68.14   0.000     .2677118    .2835695
       _cons |   3.331016   .1346811    24.73   0.000     3.067046    3.594987
-------------+----------------------------------------------------------------
        occ2 |   absorbed                                     (469 categories)

.
. //Full, BA
. use `cleaned', clear

.         //appropriate sample
.         keep if full==1
(708089 observations deleted)

.         count if incwbf < min
    0

.         drop if incwbf < min
(0 observations deleted)

.         //restrict to college grads
.         keep if yrsch>=16
(1639263 observations deleted)

. display  "BA, Full, Basic"
BA, Full, Basic

.         reg `basevar' [aw=perwt], r
(sum of wgt is   9.6731e+05)

Linear regression                                      Number of obs =  964705
                                                       F( 10,964693) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1308
                                                       Root MSE      =  .64386

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2851405   .0015915  -179.16   0.000    -.2882599   -.2820212
         age |   .3622669   .0288755    12.55   0.000     .3056719    .4188618
        age2 |  -.0090246   .0010733    -8.41   0.000    -.0111282    -.006921
        age3 |   .0001028   .0000173     5.94   0.000     .0000688    .0001367
        age4 |  -4.65e-07   1.02e-07    -4.55   0.000    -6.66e-07   -2.65e-07
       black |  -.1933084   .0030231   -63.94   0.000    -.1992336   -.1873832
        hisp |  -.2066355    .003481   -59.36   0.000     -.213458   -.1998129
       other |  -.1113274   .0062041   -17.94   0.000    -.1234872   -.0991675
        aspi |   .0032849   .0029947     1.10   0.273    -.0025845    .0091544
      year09 |   -.009313   .0019956    -4.67   0.000    -.0132243   -.0054017
      year10 |  -.0112027   .0019916    -5.62   0.000    -.0151062   -.0072992
       _cons |   5.866743   .2840125    20.66   0.000     5.310088    6.423398
------------------------------------------------------------------------------

. display  "BA, Full, Basic, Time"
BA, Full, Basic, Time

.         reg `basevar' `timevar' [aw=perwt], r
(sum of wgt is   9.6731e+05)

Linear regression                                      Number of obs =  964705
                                                       F( 12,964691) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1773
                                                       Root MSE      =   .6264

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2296207   .0015771  -145.60   0.000    -.2327117   -.2265297
         age |   .3112647   .0280952    11.08   0.000     .2561991    .3663304
        age2 |  -.0073176   .0010447    -7.00   0.000    -.0093651   -.0052701
        age3 |   .0000765   .0000168     4.54   0.000     .0000435    .0001095
        age4 |  -3.11e-07   9.96e-08    -3.12   0.002    -5.06e-07   -1.15e-07
       black |  -.1702784   .0029785   -57.17   0.000    -.1761162   -.1644405
        hisp |   -.187028    .003395   -55.09   0.000    -.1936821   -.1803739
       other |   -.106485   .0060645   -17.56   0.000    -.1183712   -.0945987
        aspi |   .0285335   .0029644     9.63   0.000     .0227233    .0343436
      year09 |  -.0078839   .0019447    -4.05   0.000    -.0116955   -.0040723
      year10 |  -.0097754   .0019411    -5.04   0.000    -.0135799    -.005971
       lnhrs |   .8168096   .0057206   142.78   0.000     .8055974    .8280218
     lnweeks |   1.347627   .0169962    79.29   0.000     1.314315    1.380939
       _cons |  -1.983827   .2848806    -6.96   0.000    -2.542184   -1.425471
------------------------------------------------------------------------------

. display  "BA, Full, Basic, Time, Educ"
BA, Full, Basic, Time, Educ

.         reg `basevar' `timevar' `educ' [aw=perwt], r
(sum of wgt is   9.6731e+05)
note: school1 omitted because of collinearity
note: school2 omitted because of collinearity
note: school3 omitted because of collinearity
note: school4 omitted because of collinearity
note: school5 omitted because of collinearity
note: school6 omitted because of collinearity
note: school7 omitted because of collinearity
note: school8 omitted because of collinearity
note: school9 omitted because of collinearity

Linear regression                                      Number of obs =  964705
                                                       F( 15,964688) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.2164
                                                       Root MSE      =  .61134

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2333812   .0015489  -150.68   0.000    -.2364169   -.2303454
         age |   .1504201   .0275805     5.45   0.000     .0963632     .204477
        age2 |  -.0020707   .0010245    -2.02   0.043    -.0040787   -.0000628
        age3 |   2.16e-06   .0000165     0.13   0.896    -.0000302    .0000345
        age4 |   7.43e-08   9.75e-08     0.76   0.446    -1.17e-07    2.65e-07
       black |   -.163044   .0029027   -56.17   0.000    -.1687333   -.1573548
        hisp |   -.182095   .0033462   -54.42   0.000    -.1886535   -.1755365
       other |  -.1106681   .0059469   -18.61   0.000    -.1223238   -.0990124
        aspi |   .0024919   .0028874     0.86   0.388    -.0031673     .008151
      year09 |  -.0075921   .0019021    -3.99   0.000    -.0113203    -.003864
      year10 |  -.0094924   .0019002    -5.00   0.000    -.0132166   -.0057681
       lnhrs |   .7066116   .0056286   125.54   0.000     .6955798    .7176434
     lnweeks |   1.415034   .0166024    85.23   0.000     1.382494    1.447574
     school1 |          0  (omitted)
     school2 |          0  (omitted)
     school3 |          0  (omitted)
     school4 |          0  (omitted)
     school5 |          0  (omitted)
     school6 |          0  (omitted)
     school7 |          0  (omitted)
     school8 |          0  (omitted)
     school9 |          0  (omitted)
    school11 |   .1710171   .0017145    99.75   0.000     .1676568    .1743774
    school12 |   .4859044   .0035738   135.96   0.000     .4788998     .492909
    school13 |   .2924692   .0039462    74.11   0.000     .2847348    .3002035
       _cons |  -.1080418   .2800009    -0.39   0.700    -.6568342    .4407505
------------------------------------------------------------------------------

. display  "BA, Full, Basic, Time, Educ, ABSORB ALL OCCS"
BA, Full, Basic, Time, Educ, ABSORB ALL OCCS

.         areg `basevar' `timevar' `educ' [aw=perwt], absorb(occ2) r
(sum of wgt is   9.6731e+05)
note: school1 omitted because of collinearity
note: school2 omitted because of collinearity
note: school3 omitted because of collinearity
note: school4 omitted because of collinearity
note: school5 omitted because of collinearity
note: school6 omitted because of collinearity
note: school7 omitted because of collinearity
note: school8 omitted because of collinearity
note: school9 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =     964705
                                                  F(  15, 964220) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.3743
                                                  Adj R-squared   =     0.3739
                                                  Root MSE        =     0.5464

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.1626489   .0015791  -103.00   0.000    -.1657439   -.1595539
         age |   .0406964    .024859     1.64   0.102    -.0080265    .0894193
        age2 |   .0014897    .000922     1.62   0.106    -.0003173    .0032967
        age3 |  -.0000503   .0000148    -3.39   0.001    -.0000793   -.0000212
        age4 |   3.72e-07   8.76e-08     4.25   0.000     2.00e-07    5.44e-07
       black |  -.1086653   .0026434   -41.11   0.000    -.1138462   -.1034843
        hisp |  -.1042691   .0029091   -35.84   0.000    -.1099708   -.0985674
       other |   -.086255   .0053068   -16.25   0.000    -.0966561   -.0758539
        aspi |  -.0414148   .0025801   -16.05   0.000    -.0464717   -.0363579
      year09 |  -.0103713   .0017302    -5.99   0.000    -.0137625   -.0069801
      year10 |  -.0093856   .0016999    -5.52   0.000    -.0127173   -.0060539
       lnhrs |   .5587073   .0052311   106.80   0.000     .5484545    .5689602
     lnweeks |   .8710193   .0155143    56.14   0.000     .8406119    .9014267
     school1 |          0  (omitted)
     school2 |          0  (omitted)
     school3 |          0  (omitted)
     school4 |          0  (omitted)
     school5 |          0  (omitted)
     school6 |          0  (omitted)
     school7 |          0  (omitted)
     school8 |          0  (omitted)
     school9 |          0  (omitted)
    school11 |   .1511323   .0016599    91.05   0.000     .1478789    .1543856
    school12 |   .2176213   .0045009    48.35   0.000     .2087996     .226443
    school13 |   .2556185   .0042152    60.64   0.000     .2473569    .2638801
       _cons |   3.850584   .2536429    15.18   0.000     3.353452    4.347715
-------------+----------------------------------------------------------------
        occ2 |   absorbed                                     (469 categories)

.
. //All, BA
. use `cleaned', clear

.         //Wage restrictions (All)
.                 //lower bound
.                 count if hwage<3
18895

.                 drop if hwage<3
(18895 observations deleted)

.                 //upperbound
.                 count if hwage>500 & full==0
 1994

.                 drop if hwage>500 & full==0
(1994 observations deleted)

.         //restrict to college grads
.         keep if yrsch>=16
(2128530 observations deleted)

.
. display  "BA, All, Basic "
BA, All, Basic

.         reg `basevar' [aw=perwt], r
(sum of wgt is   1.1620e+06)

Linear regression                                      Number of obs = 1162638
                                                       F( 10,1162626) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1188
                                                       Root MSE      =  .76832

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.3835513   .0017344  -221.14   0.000    -.3869507   -.3801519
         age |   .8832842   .0316073    27.95   0.000      .821335    .9452334
        age2 |  -.0280003    .001172   -23.89   0.000    -.0302973   -.0257033
        age3 |   .0004037   .0000189    21.41   0.000     .0003668    .0004407
        age4 |  -2.22e-06   1.11e-07   -20.00   0.000    -2.44e-06   -2.01e-06
       black |  -.1431996   .0033182   -43.16   0.000    -.1497031   -.1366961
        hisp |  -.2008927   .0036515   -55.02   0.000    -.2080494   -.1937359
       other |  -.1199999   .0067542   -17.77   0.000    -.1332378    -.106762
        aspi |   .0045536   .0032088     1.42   0.156    -.0017356    .0108428
      year09 |  -.0047879    .002155    -2.22   0.026    -.0090116   -.0005642
      year10 |  -.0128079   .0021551    -5.94   0.000    -.0170319   -.0085839
       _cons |   .5145951   .3116864     1.65   0.099    -.0962996     1.12549
------------------------------------------------------------------------------

. display  "BA, All, Basic, Time"
BA, All, Basic, Time

.         reg `basevar' `timevar' [aw=perwt], r
(sum of wgt is   1.1620e+06)

Linear regression                                      Number of obs = 1162638
                                                       F( 12,1162624) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.3803
                                                       Root MSE      =  .64435

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |   -.227347   .0015052  -151.04   0.000    -.2302972   -.2243968
         age |   .4112677    .026239    15.67   0.000     .3598402    .4626951
        age2 |  -.0108204   .0009751   -11.10   0.000    -.0127316   -.0089092
        age3 |   .0001287   .0000157     8.19   0.000     .0000979    .0001595
        age4 |  -5.91e-07   9.29e-08    -6.36   0.000    -7.73e-07   -4.09e-07
       black |  -.1435003   .0028342   -50.63   0.000    -.1490552   -.1379454
        hisp |  -.1758074   .0031143   -56.45   0.000    -.1819112   -.1697035
       other |  -.0966462   .0056134   -17.22   0.000    -.1076483    -.085644
        aspi |   .0343228   .0027761    12.36   0.000     .0288818    .0397638
      year09 |  -.0028916   .0018234    -1.59   0.113    -.0064653    .0006821
      year10 |  -.0068665   .0018179    -3.78   0.000    -.0104295   -.0033036
       lnhrs |   .9950325   .0033557   296.52   0.000     .9884554     1.00161
     lnweeks |   .8548778   .0035019   244.12   0.000     .8480142    .8617413
       _cons |  -1.766346   .2580687    -6.84   0.000    -2.272151    -1.26054
------------------------------------------------------------------------------

. display  "BA, All, Basic, Time, Educ"
BA, All, Basic, Time, Educ

.         reg `basevar' `timevar' `educ' [aw=perwt], r
(sum of wgt is   1.1620e+06)
note: school1 omitted because of collinearity
note: school2 omitted because of collinearity
note: school3 omitted because of collinearity
note: school4 omitted because of collinearity
note: school5 omitted because of collinearity
note: school6 omitted because of collinearity
note: school7 omitted because of collinearity
note: school8 omitted because of collinearity
note: school9 omitted because of collinearity

Linear regression                                      Number of obs = 1162638
                                                       F( 15,1162621) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.4074
                                                       Root MSE      =  .63007

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.2285578   .0014814  -154.28   0.000    -.2314613   -.2256542
         age |   .2677886    .025814    10.37   0.000      .217194    .3183832
        age2 |   -.006193   .0009585    -6.46   0.000    -.0080715   -.0043145
        age3 |    .000064   .0000154     4.14   0.000     .0000337    .0000942
        age4 |  -2.61e-07   9.11e-08    -2.87   0.004    -4.40e-07   -8.28e-08
       black |   -.132965   .0027762   -47.90   0.000    -.1384062   -.1275238
        hisp |  -.1687581   .0030754   -54.87   0.000    -.1747858   -.1627304
       other |  -.1006017   .0055164   -18.24   0.000    -.1114136   -.0897899
        aspi |   .0111951   .0027118     4.13   0.000     .0058801    .0165101
      year09 |  -.0027801   .0017876    -1.56   0.120    -.0062837    .0007235
      year10 |  -.0065456   .0017833    -3.67   0.000    -.0100408   -.0030504
       lnhrs |   .9613375   .0032948   291.78   0.000     .9548799    .9677951
     lnweeks |   .8573033   .0034906   245.61   0.000     .8504619    .8641447
     school1 |          0  (omitted)
     school2 |          0  (omitted)
     school3 |          0  (omitted)
     school4 |          0  (omitted)
     school5 |          0  (omitted)
     school6 |          0  (omitted)
     school7 |          0  (omitted)
     school8 |          0  (omitted)
     school9 |          0  (omitted)
    school11 |    .172314   .0016097   107.05   0.000      .169159     .175469
    school12 |   .4746157   .0033284   142.60   0.000     .4680922    .4811393
    school13 |    .299886    .003815    78.61   0.000     .2924086    .3073633
       _cons |  -.1075536   .2541992    -0.42   0.672    -.6057753    .3906682
------------------------------------------------------------------------------

. display  "BA, All, Basic, Time, Educ, ABSORB ALL OCCS"
BA, All, Basic, Time, Educ, ABSORB ALL OCCS

.         areg `basevar' `timevar' `educ' [aw=perwt], absorb(occ2) r
(sum of wgt is   1.1620e+06)
note: school1 omitted because of collinearity
note: school2 omitted because of collinearity
note: school3 omitted because of collinearity
note: school4 omitted because of collinearity
note: school5 omitted because of collinearity
note: school6 omitted because of collinearity
note: school7 omitted because of collinearity
note: school8 omitted because of collinearity
note: school9 omitted because of collinearity

Linear regression, absorbing indicators           Number of obs   =    1162638
                                                  F(  15,1162153) =          .
                                                  Prob > F        =          .
                                                  R-squared       =     0.5249
                                                  Adj R-squared   =     0.5247
                                                  Root MSE        =     0.5643

------------------------------------------------------------------------------
             |               Robust
    lnincwbf |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |  -.1630332   .0015068  -108.20   0.000    -.1659866   -.1600799
         age |   .1358692   .0233162     5.83   0.000     .0901702    .1815683
        age2 |  -.0020149   .0008646    -2.33   0.020    -.0037094   -.0003203
        age3 |   4.42e-06   .0000139     0.32   0.751    -.0000228    .0000317
        age4 |   6.43e-08   8.20e-08     0.78   0.433    -9.65e-08    2.25e-07
       black |  -.0786866     .00254   -30.98   0.000     -.083665   -.0737082
        hisp |    -.08693   .0026951   -32.26   0.000    -.0922123   -.0816478
       other |  -.0766976   .0049873   -15.38   0.000    -.0864725   -.0669226
        aspi |  -.0288943    .002427   -11.91   0.000    -.0336511   -.0241374
      year09 |  -.0065798   .0016291    -4.04   0.000    -.0097727   -.0033868
      year10 |  -.0069275   .0015982    -4.33   0.000    -.0100599   -.0037951
       lnhrs |   .8176509   .0031128   262.68   0.000       .81155    .8237518
     lnweeks |   .8104974   .0033393   242.71   0.000     .8039524    .8170423
     school1 |          0  (omitted)
     school2 |          0  (omitted)
     school3 |          0  (omitted)
     school4 |          0  (omitted)
     school5 |          0  (omitted)
     school6 |          0  (omitted)
     school7 |          0  (omitted)
     school8 |          0  (omitted)
     school9 |          0  (omitted)
    school11 |   .1439975    .001571    91.66   0.000     .1409184    .1470767
    school12 |   .2009813   .0041918    47.95   0.000     .1927656     .209197
    school13 |   .2451983   .0040361    60.75   0.000     .2372878    .2531089
       _cons |    2.14675   .2299844     9.33   0.000     1.695988    2.597512
-------------+----------------------------------------------------------------
        occ2 |   absorbed                                     (469 categories)

.
. log close
      name:  <unnamed>
       log:  /disk/bulkv/emanueln/ACS/female_wage2/absorb.txt
  log type:  text
 closed on:  29 Sep 2013, 09:16:39
-------------------------------------------------------------------------------

. exit, clear

end of do-file
